---
title: MEPAnalyticalConnectionType
classe: Autodesk.Revit.DB.MEPAnalyticalConnectionType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# MEPAnalyticalConnectionType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double PressureLoss { get; set; }` | `mEPAnalyticalConnectionType.PressureLoss` | Double |
| `MEPAnalyticalConnectionType Create(Document, String)` | `MEPAnalyticalConnectionType.Create(doc, name)` | MEPAnalyticalConnectionType |
| `ElementId FindTypeByName(Document, String)` | `MEPAnalyticalConnectionType.FindTypeByName(doc, name)` | ElementId |
| `Boolean IsNameUnused(Document, String)` | `MEPAnalyticalConnectionType.IsNameUnused(doc, name)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```